In [65]:
import pandas as pd

In [66]:
df = pd.read_csv("./car_price.csv")

In [67]:
df.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03,86226.0,Diesel,Manual,1st,2017.0,1956.0,5.0
1,1,Renault Duster RXZ Turbo CVT,12.83,13248.0,Petrol,Automatic,1st,2021.0,1330.0,5.0
2,2,Toyota Camry 2.5 G,16.40,60343.0,Petrol,Automatic,1st,2016.0,2494.0,5.0
3,3,Toyota Camry 2.5 G,16.40,60343.0,Petrol,Automatic,1st,2016.0,2494.0,5.0
4,4,Volkswagen Polo 1.2 MPI Highline,5.15,69414.0,Petrol,Manual,1st,2016.0,1199.0,5.0

In [68]:
print(df.dtypes)

Unnamed: 0               int64
car_name                object
car_prices_in_rupee    float64
kms_driven             float64
fuel_type               object
transmission            object
ownership               object
manufacture            float64
engine                 float64
Seats                  float64
dtype: object

In [69]:
# df['kms_driven'] = df['kms_driven'].str.replace(',', '')

In [70]:
df.head()

,Unnamed: 0,car_name,car_prices_in_rupee,kms_driven,fuel_type,transmission,ownership,manufacture,engine,Seats
0,0,Jeep Compass 2.0 Longitude Option BSIV,10.03,86226.0,Diesel,Manual,1st,2017.0,1956.0,5.0
1,1,Renault Duster RXZ Turbo CVT,12.83,13248.0,Petrol,Automatic,1st,2021.0,1330.0,5.0
2,2,Toyota Camry 2.5 G,16.40,60343.0,Petrol,Automatic,1st,2016.0,2494.0,5.0
3,3,Toyota Camry 2.5 G,16.40,60343.0,Petrol,Automatic,1st,2016.0,2494.0,5.0
4,4,Volkswagen Polo 1.2 MPI Highline,5.15,69414.0,Petrol,Manual,1st,2016.0,1199.0,5.0

In [71]:
print(df.dtypes)

Unnamed: 0               int64
car_name                object
car_prices_in_rupee    float64
kms_driven             float64
fuel_type               object
transmission            object
ownership               object
manufacture            float64
engine                 float64
Seats                  float64
dtype: object

In [72]:
df['kms_driven'] = df['kms_driven'].astype(float)

df['car_prices_in_rupee'] = df['car_prices_in_rupee'].astype(float)

In [73]:
print(df.dtypes)

Unnamed: 0               int64
car_name                object
car_prices_in_rupee    float64
kms_driven             float64
fuel_type               object
transmission            object
ownership               object
manufacture            float64
engine                 float64
Seats                  float64
dtype: object

In [3]:
import pandas as pd
df = pd.read_csv("heart_statlog_cleveland_hungary_final.csv")

In [4]:
print(df.dtypes)

age                      int64
sex                      int64
chest pain type          int64
resting bp s             int64
cholesterol              int64
fasting blood sugar      int64
resting ecg              int64
max heart rate           int64
exercise angina          int64
oldpeak                float64
ST slope                 int64
target                   int64
dtype: object

In [5]:
df.head()

,age,sex,chest pain type,resting bp s,cholesterol,fasting blood sugar,resting ecg,max heart rate,exercise angina,oldpeak,ST slope,target
0,40,1,2,140,289,0,0,172,0,0.0,1,0
1,49,0,3,160,180,0,0,156,0,1.0,2,1
2,37,1,2,130,283,0,1,98,0,0.0,1,0
3,48,0,4,138,214,0,0,108,1,1.5,2,1
4,54,1,3,150,195,0,0,122,0,0.0,1,0